from sklearn.feature_extraction.text import CountVectorizer
from sklearn.naive_bayes import MultinomialNB
import random

texts = [
    "Здравствуй",
    "Привет",
    "Как дела?",
    "Что ты умеешь?",
    "Пока",
    "До свидания",
    "Пог",
    "Если пог погу не пог то пог не пог",
    "Замечательно",
    "Классно",
    "Грустно",
    "Дождь",
    "Солнечно",
    "Ты молодец",
    "Ты умный",
]

labels = [
    "Приветствие",
    "Приветствие",
    "Вопрос",
    "Вопрос",
    "Прощание",
    "Прощание",
    "Шутка",
    "Шутка",
    "Настроение",
    "Настроение",
    "Настроение",
    "Погода",
    "Погода",
    "Комплимент",
    "Комплимент",
]

answers = {
    "Приветствие": ["Привет!", "Здравствуй", "Добрый день!"],
    "Вопрос": ["Нормально", "Как обычно", "Хорошо, а ты?", "Замечательно!"],
    "Прощание": ["Пока!", "До свидания","До встречи!"],
    "Шутка": ["Пог", "Ха-ха", "Смешно",],
    "Настроение": ["ну и хорошо", "понял", "ок",],
    "Погода": ["Пог", "Не знаю", "Может быть",],
    "Комплимент": ["Спасибо!", "Ты тоже!",]
}

vectorizer = CountVectorizer()
X = vectorizer.fit_transform(texts)

model = MultinomialNB()
model.fit(X, labels)

print("ИИ готов общаться!")

while True:
    text = input("Ты: ")
    if text.lower() == "выход":
        print("ИИ: Пока!")
        break

    X_test = vectorizer.transform([text])
    result = model.predict(X_test)[0]
    
    pog = random.choice(answers.get(result, ["Я пока не знаю, что мне ответить"]))
    print("ИИ:", pog)